/**
 * 🖼️ Launcher 2D Skins Manager
 * ----------------------------------------------------------
 * Author  : Luuxis
 * License : CC-BY-NC 4.0 - https://creativecommons.org/licenses/by-nc/4.0
 * Purpose : Expose the 2D skin utility for the launcher frontend
 * ----------------------------------------------------------
 */

'use strict';

/* ╔════════════════════════════════════════════════════╗
   ║ 🎨 IMPORT SKIN 2D MODULE                             ║
   ╚════════════════════════════════════════════════════╝ */
import { skin2D } from './Skin/skin2D.js';

/* ╔════════════════════════════════════════════════════╗
   ║ 🔗 EXPORT MODULE                                     ║
   ╚════════════════════════════════════════════════════╝ */
export { skin2D as skin2D };